tap "homebrew/bundle"

# System utilities
brew "awscli"
brew "coreutils"
brew "bat"
brew "eza"
brew "gnu-sed"
brew "go"
brew "yq"
brew "jq"
brew "pkgconf"
brew "htop"
brew "httpie"
brew "mas"
brew "pipx"
brew "pwgen"
brew "tmux"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "virt-manager"
brew "watch"
brew "wget"
cask "alacritty", args: { no_quarantine: true }
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
cask "font-jetbrains-mono-nerd-font"
cask "podman-desktop"
cask "wireshark"
cask "dbeaver-community"
brew "mtr"
brew "freerdp"
tap "hashicorp/tap"
brew "hashicorp/tap/vault"

# Kubernetes tooling
brew "kind"
brew "stern"
brew "helm"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"

# Nvim and nvim supporting tools
brew "neovim"
brew "black"
brew "luarocks"
brew "node"
brew "pre-commit"
brew "prettier"
brew "fd"
brew "rust"
brew "stylua"
brew "yaml-language-server"

# Browsers
cask "vivaldi"
cask "firefox"

# App Store apps
mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
