tap "homebrew/bundle"
tap "hashicorp/tap"
tap "atlassian/acli"
tap "avivsinai/tap"
tap "dynatrace-internal/tap"
tap "dynatrace-oss/tap"
tap "robscott/tap"

# System utilities
brew "awscli"
brew "coreutils"
brew "bat"
brew "eza"
brew "gnu-sed"
brew "go"
brew "yq"
brew "jq"
brew "pkgconf"
brew "htop"
brew "httpie"
brew "mas"
brew "pipx"
brew "pwgen"
brew "tmux"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "virt-manager"
brew "watch"
brew "wget"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "mtr"
brew "freerdp"
brew "ipcalc"
brew "ncdu"
brew "nmap"
brew "restic"
brew "redis"
brew "pipenv"
brew "pyenv-virtualenv"
brew "gh"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "dynatrace-internal/tap/junoctl"

# Kubernetes tooling
brew "kind"
brew "stern"
brew "helm"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "argocd"

# Nvim and nvim supporting tools
brew "neovim"
brew "black"
brew "luarocks"
brew "node"
brew "pre-commit"
brew "prettier"
brew "fd"
brew "rust"
brew "stylua"
brew "yaml-language-server"

# Browsers
cask "vivaldi"
cask "firefox"

# Mac utilities
cask "rectangle"
cask "ghostty"

# Development tools
cask "alacritty"
cask "visual-studio-code"
cask "httpie-desktop"
cask "apache-directory-studio"
cask "podman-desktop"
cask "dbeaver-community"
cask "wireshark"
cask "powershell"
cask "dtctl"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# App Store apps
mas "Amphetamine", id: 937984704
mas "Microsoft To Do", id: 1274495053
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
